DiplomD/src/Documents/УспеваемостьСтудентов/УспеваемостьСтудентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УспеваемостьСтудентов</name>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧ</name>
    <attributes>
      <name>Студент</name>
      <type>
        <types>CatalogRef.СписокСтудентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Дисциплина</name>
      <type>
        <types>CatalogRef.РабочаяПрограммаДисцилины</types>
      </type>
    </attributes>
    <attributes>
      <name>НаличиеАкадемЗадолженности</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаявлениеНаПереаттестацию</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

DiplomD/src/Enums/ВидыОценокЗачет/ВидыОценокЗачет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОценокЗачет</name>
  <enumValues>
    <name>Зачтено</name>
  </enumValues>
  <enumValues>
    <name>НеЗачтено</name>
  </enumValues>
</mdclass:Enum>

DiplomD/src/Enums/Семестры/Семестры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Семестры</name>
  <enumValues>
    <name>Псеместр</name>
  </enumValues>
  <enumValues>
    <name>Втсеместр</name>
  </enumValues>
  <enumValues>
    <name>Трсеместр</name>
  </enumValues>
  <enumValues>
    <name>Чтсеместр</name>
  </enumValues>
  <enumValues>
    <name>ПятСеместр</name>
  </enumValues>
  <enumValues>
    <name>ШесСеместр</name>
  </enumValues>
  <enumValues>
    <name>СедСеместр</name>
  </enumValues>
  <enumValues>
    <name>ВосСеместр</name>
  </enumValues>
</mdclass:Enum>

DiplomD/src/Documents/ЗачетнаяКнижкаСтудента/ЗачетнаяКнижкаСтудента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗачетнаяКнижкаСтудента</name>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.СписокСтудентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗачетнойКнижки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильНаправления</name>
    <type>
      <types>CatalogRef.ПрофилиНаправления</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокАттестационныхДисцилин</name>
    <attributes>
      <name>Дисциплина</name>
      <type>
        <types>CatalogRef.РабочаяПрограммаДисцилины</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Семестр</name>
      <type>
        <types>EnumRef.Семестры</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемДисциплины</name>
      <type>
        <types>CatalogRef.ОбъемыПромежуточнойАттестации</types>
      </type>
    </attributes>
    <attributes>
      <name>Оценка</name>
      <type>
        <types>Number</types>
        <types>EnumRef.ВидыОценокЗачет</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Долг</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Перезачтено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Преподаватель</name>
      <type>
        <types>CatalogRef.ПреподавательскийСостав</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбщийСеместровыйРейтинг</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

DiplomD/src/Documents/ЗаявленияНаПересдачу/ЗаявленияНаПересдачу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявленияНаПересдачу</name>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.СписокСтудентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаГосударственнойИтоговойАттестации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧ</name>
    <attributes>
      <name>Дисциплина</name>
      <type>
        <types>CatalogRef.РабочаяПрограммаДисцилины</types>
      </type>
    </attributes>
    <attributes>
      <name>Семестр</name>
      <type>
        <types>EnumRef.Семестры</types>
      </type>
    </attributes>
    <attributes>
      <name>Курс</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Преподаватель</name>
      <type>
        <types>CatalogRef.ПреподавательскийСостав</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

DiplomD/src/Documents/УспеваемостьСтудентов/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура СеместрПриИзмененииНаСервере()
		Если Не ПустаяСтрока(Объект.Группа) тогда 
		Объект.ТЧ.Очистить();
		Запрос = Новый запрос; 
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЗачетнаяКнижкаСтудентаСписокАттестационныхДисцилин.Ссылка.Студент КАК Студент,
		               |	ЗачетнаяКнижкаСтудентаСписокАттестационныхДисцилин.Оценка КАК Оценка,
		               |	ЗачетнаяКнижкаСтудентаСписокАттестационныхДисцилин.Дисциплина КАК Дисциплина
		               |ИЗ
		               |	Документ.ЗачетнаяКнижкаСтудента.СписокАттестационныхДисцилин КАК ЗачетнаяКнижкаСтудентаСписокАттестационныхДисцилин
		               |ГДЕ
		               |	ЗачетнаяКнижкаСтудентаСписокАттестационныхДисцилин.Ссылка.Группа = &Группа";
		Запрос.УстановитьПараметр("Группа",Объект.Группа); 
		Рез = Запрос.Выполнить().Выгрузить(); 
		Для каждого стр из рез Цикл 
			Если ПустаяСтрока(Стр.Оценка) ИЛИ Стр.Оценка = Перечисления.ВидыОценокЗачет.НеЗачтено ИЛИ Стр.Оценка = 2 Тогда
				О = Объект.ТЧ.Добавить();
				О.студент = Стр.Студент; 
				О.Дисциплина = Стр.Дисциплина; 
				О.наличиеАкадемЗадолженности = истина; 
				
			КонецЕсли; 
			
			
		КонецЦикла; 
		
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СеместрПриИзменении(Элемент)
	СеместрПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаявленияНаПереаттестациюНаСервере()
	Для каждого стр из объект.ТЧ Цикл  
		Если Стр.ЗаявлениеНаПереаттестацию = истина Тогда  
			Док = Документы.ЗаявленияНаПересдачу.СоздатьДокумент(); 
			Док.Дата = ТекущаяДата(); 
			Док.Студент = стр.Студент; 
			Док.Группа = Объект.Группа;
			
			Запрос = Новый запрос; 
			Запрос.Текст = "ВЫБРАТЬ
			               |	ЗачетнаяКнижкаСтудентаСписокАттестационныхДисцилин.Дисциплина КАК Дисциплина,
			               |	ЗачетнаяКнижкаСтудентаСписокАттестационныхДисцилин.Семестр КАК Семестр,
			               |	ЗачетнаяКнижкаСтудентаСписокАттестационныхДисцилин.Преподаватель КАК Преподаватель,
			               |	ЗачетнаяКнижкаСтудентаСписокАттестационныхДисцилин.Оценка КАК Оценка,
			               |	ЗачетнаяКнижкаСтудентаСписокАттестационныхДисцилин.Долг КАК Долг
			               |ИЗ
			               |	Документ.ЗачетнаяКнижкаСтудента.СписокАттестационныхДисцилин КАК ЗачетнаяКнижкаСтудентаСписокАттестационныхДисцилин
			               |ГДЕ
			               |	ЗачетнаяКнижкаСтудентаСписокАттестационныхДисцилин.Ссылка.Студент = &Студент
			               |	И ЗачетнаяКнижкаСтудентаСписокАттестационныхДисцилин.Семестр = &Семестр";
		Запрос.УстановитьПараметр("Студент",стр.Студент); 
		Запрос.УстановитьПараметр("Семестр",Объект.Семестр); 
		рез = Запрос.Выполнить().Выгрузить(); 
		Для каждого строка из рез Цикл 
			Если пустаяСтрока(строка.Оценка) ИЛИ Строка.Оценка = Перечисления.ВидыОценокЗачет.НеЗачтено ИЛИ Строка.Оценка = 2 Тогда 
			О = Док.ТЧ.Добавить(); 
			О.Дисциплина = Строка.Дисциплина; 
			О.Семестр = Строка.Семестр; 
			Если Строка.Семестр = перечисления.Семестры.Псеместр ИЛИ Строка.Семестр = перечисления.Семестры.Втсеместр Тогда 
				Курс = 1; 
			КонецЕсли; 
			Если Строка.Семестр = перечисления.Семестры.Трсеместр ИЛИ Строка.Семестр = перечисления.Семестры.Чтсеместр Тогда 
				Курс = 2; 
			КонецЕсли;
			Если Строка.Семестр = перечисления.Семестры.ПятСеместр ИЛИ Строка.Семестр = перечисления.Семестры.ШесСеместр Тогда 
				Курс = 3; 
			КонецЕсли;
			О.Курс = Курс; 
			О.Преподаватель = Строка.Преподаватель; 
			КонецЕсли; 
			
			
		КонецЦикла; 
		  Попытка
		Док.Записать(РежимЗаписиДокумента.Запись); 
		  Док.Записать(РежимЗаписиДокумента.Проведение);
		  Сообщить("Создано заявление на переаттестацию для студента (ки)" + " " + Стр.Студент); 
	  Исключение 
		  Сообщить("Заявление на переаттестацию не создано"); 
		  КонецПопытки; 
		  
		  
		КонецЕсли; 
		
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаявленияНаПереаттестацию(Команда)
	СоздатьЗаявленияНаПереаттестациюНаСервере();
КонецПроцедуры
